![New York City schoolbus](schoolbus.jpg)

Photo by [Jannis Lucas](https://unsplash.com/@jannis_lucas) on [Unsplash](https://unsplash.com).
<br>

Every year, American high school students take SATs, which are standardized tests intended to measure literacy, numeracy, and writing skills. There are three sections - reading, math, and writing, each with a **maximum score of 800 points**. These tests are extremely important for students and colleges, as they play a pivotal role in the admissions process.

Analyzing the performance of schools is important for a variety of stakeholders, including policy and education professionals, researchers, government, and even parents considering which school their children should attend. 

You have been provided with a dataset called `schools.csv`, which is previewed below.

You have been tasked with answering three key questions about New York City (NYC) public school SAT performance.

In [5]:
# Re-run this cell 
import pandas as pd

# Read in the data
schools = pd.read_csv("schools.csv")

# Preview the data
schools.head()

# Start coding here...
# Add as many cells as you like...

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7

In [17]:
# Filter for average_maths > 80% 
best_avg_maths = schools['average_math'] >= (0.8 * 800) 

#Subset with Filter 
best_in_maths = schools[best_avg_maths] 

# Sort the subset based on average_math
best_in_maths_srt = best_in_maths.sort_values('average_math', ascending=False)

# Find the best 5 schools in maths
best_math_schools = best_in_maths_srt.loc[:, ['school_name', 'average_math']]

best_math_schools.head()

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683

In [18]:
# Calculate SAT Column 
schools['total_SAT'] = schools['average_math'] + schools['average_reading'] + schools['average_writing'] 

# Find Top 10 schools in in total_SAT Scores
top_10_schools = (schools.sort_values('total_SAT', ascending=False)).head(10)

# Slicing required columns and set total_SAT in descending order
top_10_schools = top_10_schools.loc[:, ['school_name', 'total_SAT']]

top_10_schools

                                           school_name  total_SAT
88                              Stuyvesant High School       2144
170                       Bronx High School of Science       2041
93                 Staten Island Technical High School       2041
174  High School of American Studies at Lehman College       2013
333                        Townsend Harris High School       1981
365  Queens High School for the Sciences at York Co...       1947
5                       Bard High School Early College       1914
280                     Brooklyn Technical High School       1896
45                       Eleanor Roosevelt High School       1889
68   High School for Mathematics, Science, and Engi...       1889

In [22]:
# Calculate Standard Deviation and Mean of total_SAT column grouped by borough
borough_sat_mean_std = schools.groupby('borough')['total_SAT'].agg(['std', 'mean']).round(2) 

borough_sat_mean_std 



# # Create filter for maximum std_dev
# std_max = borough_sat_mean_std['std'].max() 

# print(std_max) 

# # Subset with max std_dev filter
# largest_std_dev = borough_sat_mean_std[borough_sat_mean_std['std'] == std_max]

# largest_std_dev

# # Rearrange columns to num_schools, mean and std_dev
# largest_std_dev = largest_std_dev[['num_schools', 'mean', 'std']]

# # Dictionary for renaming columns
# names_dict = {'mean': 'average_SAT', 'std':'std_SAT'} 

# # Rename Columns
# largest_std_dev = largest_std_dev.rename(columns=names_dict)

# largest_std_dev

                  std     mean
borough
Bronx          150.39  1202.72
Brooklyn       154.87  1230.26
Manhattan      230.29  1340.13
Queens         195.25  1345.48
Staten Island  222.30  1439.00

In [23]:
# Add num_schools column with number of schools in each borough 
borough_sat_mean_std['num_schools'] = schools['borough'].value_counts()

borough_sat_mean_std

                  std     mean  num_schools
borough
Bronx          150.39  1202.72           98
Brooklyn       154.87  1230.26          109
Manhattan      230.29  1340.13           89
Queens         195.25  1345.48           69
Staten Island  222.30  1439.00           10

In [24]:
# Create filter for maximum std_dev
std_max = borough_sat_mean_std['std'].max() 

print(std_max)

230.29

In [25]:
# Subset with max std_dev filter
largest_std_dev = borough_sat_mean_std[borough_sat_mean_std['std'] == std_max]

print(largest_std_dev)

              std     mean  num_schools
borough
Manhattan  230.29  1340.13           89

In [27]:
# Rearrange columns to num_schools, mean and std_dev
largest_std_dev = largest_std_dev[['num_schools', 'mean', 'std']]

print(largest_std_dev)

           num_schools     mean     std
borough
Manhattan           89  1340.13  230.29

In [28]:
# Dictionary for renaming columns
names_dict = {'mean': 'average_SAT', 'std':'std_SAT'}

In [29]:
# Rename Columns
largest_std_dev = largest_std_dev.rename(columns=names_dict)

largest_std_dev

           num_schools  average_SAT  std_SAT
borough
Manhattan           89      1340.13   230.29